.config/emacs/colorscheme.el
(require 'org-faces)
(require 'tree-sitter-hl)

(set-face-attribute 'default nil
                    :foreground FOREGROUND_1
                    :background BACKGROUND_1)
(set-face-attribute 'fringe nil
                    :foreground FOREGROUND_1
                    :background BACKGROUND_1)
(set-face-attribute 'cursor nil
                    :foreground FOREGROUND_2)
