.config/emacs/README.org
** Headerline
#+begin_src emacs-lisp
  (set-face-attribute 'header-line nil
                      :background BACKGROUND_2
                      :foreground FOREGROUND_2)
#+end_src
** Modeline
#+begin_src emacs-lisp
  (set-face-attribute 'mode-line nil
                      :background BACKGROUND_2
                      :foreground FOREGROUND_2
                      :box nil)
  (set-face-attribute 'mode-line-highlight nil
                      :background HIGHLIGHT_BG
                      :foreground HIGHLIGHT_FG
                      :box nil)
  (set-face-attribute 'mode-line-inactive nil
                      :background INACTIVE)
#+end_src
** Corfu
#+begin_src emacs-lisp
  (set-face-attribute 'corfu-default nil
                      :background BACKGROUND_2
                      :foreground FOREGROUND_2)
#+end_src
** Org Mode
#+begin_src emacs-lisp
  (set-face-background 'org-block BACKGROUND_2)
  (set-face-background 'org-block-begin-line BACKGROUND_2)
  (set-face-background 'org-block-end-line BACKGROUND_2)
  (set-face-attribute 'org-level-1 nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-2 nil :height 1.3 :weight 'bold)
  (set-face-attribute 'org-level-3 nil :height 1.1 :weight 'bold)
  (set-face-attribute 'org-level-4 nil :weight 'normal)
  (set-face-attribute 'org-level-5 nil :weight 'normal)
  (set-face-attribute 'org-level-6 nil :weight 'normal)
  (set-face-attribute 'org-level-7 nil :weight 'normal)
  (set-face-attribute 'org-level-8 nil :weight 'normal)
#+end_src
** Org Roam UI
#+begin_src emacs-lisp
(setq org-roam-ui-custom-theme
    `((bg . ,BACKGROUND_1)
        (bg-alt . ,BACKGROUND_2)
        (fg . ,FOREGROUND_1)
        (fg-alt . ,FOREGROUND_2)
        (red . ,RED)
        (orange . ,ORANGE)
        (yellow . ,YELLOW)
        (green . ,GREEN)
        (cyan . ,CYAN)
        (blue . ,BLUE)
        (violet . ,PINK)
        (magenta . ,MAGENTA)))
#+end_src
** Programming
*** Comments
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-comment-face nil
                      :foreground COMMENT
                      :slant 'italic)
  (set-face-attribute 'font-lock-comment-delimiter-face nil
                      :inherit 'font-lock-comment-face)
  (set-face-attribute 'tree-sitter-hl-face:comment nil
                      :inherit font-lock-comment-face)
#+end_src
*** Keywords
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-keyword-face nil
                      :foreground KEYWORD)
  (set-face-attribute 'tree-sitter-hl-face:keyword nil
                      :inherit 'font-lock-keyword-face)
#+end_src
*** Operators
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-operator-face nil
                      :foreground OPERATOR)
  (set-face-attribute 'tree-sitter-hl-face:operator nil
                      :inherit 'font-lock-operator-face)
#+end_src
*** Strings
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-string-face nil
                      :foreground STRING)
  (set-face-attribute 'tree-sitter-hl-face:string nil
                      :inherit 'font-lock-string-face)
#+end_src
*** Builtins
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-builtin-face nil
                      :foreground BUILTIN)
  (set-face-attribute 'tree-sitter-hl-face:constant.builtin nil
                      :inherit 'font-lock-builtin-face)
  (set-face-attribute 'tree-sitter-hl-face:function.builtin nil
                      :inherit 'font-lock-builtin-face)
#+end_src
*** Numbers
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-number-face nil
                      :foreground NUMBER)
  (set-face-attribute 'tree-sitter-hl-face:number nil
                      :foreground NUMBER)
#+end_src
*** Variables
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-variable-use-face nil
                      :foreground VARIABLE)
  (set-face-attribute 'font-lock-variable-name-face nil
                      :foreground VARIABLE)
  (set-face-attribute 'tree-sitter-hl-face:variable nil
                      :foreground VARIABLE)
  (set-face-attribute 'tree-sitter-hl-face:variable.parameter nil
                      :inherit 'tree-sitter-hl-face:variable
                      :weight 'normal)
#+end_src
*** Functions
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-function-name-face nil
                      :foreground FUNCTION)
  (set-face-attribute 'font-lock-function-call-face nil
                      :foreground FUNCTION
                      :slant 'italic)
  (set-face-attribute 'tree-sitter-hl-face:function nil
                      :inherit 'font-lock-function-name-face)
  (set-face-attribute 'tree-sitter-hl-face:function.call nil
                      :inherit 'font-lock-function-call-face)
#+end_src
*** Methods
#+begin_src emacs-lisp
  (set-face-attribute 'tree-sitter-hl-face:method nil
                      :foreground METHOD)
  (set-face-attribute 'tree-sitter-hl-face:method.call nil
                      :slant 'italic
                      :foreground METHOD)
#+end_src
*** Classes
#+begin_src emacs-lisp
  (set-face-attribute 'tree-sitter-hl-face:constructor nil
                      :foreground CLASS)
#+end_src
*** Attributes
#+begin_src emacs-lisp
  (set-face-attribute 'tree-sitter-hl-face:property nil
                      :foreground ATTRIBUTE)
  (set-face-attribute 'tree-sitter-hl-face:attribute nil
                      :foreground ATTRIBUTE)
#+end_src
*** Parameters
#+begin_src emacs-lisp
  (set-face-attribute 'tree-sitter-hl-face:type.parameter nil
                      :foreground PARAMETER)
  (set-face-attribute 'tree-sitter-hl-face:type.argument nil
                      :foreground PARAMETER
                      :slant 'italic)
#+end_src
*** Types
#+begin_src emacs-lisp
  (set-face-attribute 'font-lock-constant-face nil
                      :foreground TYPE)
  (set-face-attribute 'tree-sitter-hl-face:type nil
                      :foreground TYPE)
  (set-face-attribute 'tree-sitter-hl-face:constant nil
                      :foreground TYPE)
#+end_src
