.config/emacs/README.org
*** Misc
#+begin_src emacs-lisp
  (set-face-attribute 'tree-sitter-hl-face:escape nil
                      :inherit 'font-lock-string
                      :foreground KEYWORD)
  (set-face-attribute 'show-paren-match nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG)
#+end_src

#+begin_src emacs-lisp


  (set-face-attribute 'font-lock-doc-face nil
                      :inherit 'font-lock-comment-face)
  (set-face-attribute 'link nil
                      :foreground CYAN
                      :underline t)
  (set-face-attribute 'link-visited nil
                      :foreground MAGENTA
                      :underline t)

  (set-face-attribute 'font-lock-negation-char-face nil
                      :inherit 'font-lock-operator-face)
  (set-face-attribute 'font-lock-preprocessor-face nil
                      :foreground ORANGE)

  (set-face-attribute 'line-number nil
                      :foreground COMMENT)
  (set-face-attribute 'line-number-current-line nil
                      :foreground FOREGROUND_1)

  (set-face-attribute 'tree-sitter-hl-face:constant nil
                      :inherit 'font-lock-constant-face)



  (set-face-attribute 'warning nil
                      :foreground ORANGE)
  (set-face-attribute 'font-lock-warning-face nil
                      :inherit 'warning)


  (set-face-attribute 'tree-sitter-hl-face:variable.parameter nil
                      :foreground PARAMETER)
  (set-face-attribute 'region nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG
                      :weight 'bold)
  (set-face-attribute 'mode-line-highlight nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG)

  (set-face-attribute 'window-divider nil
                      :foreground INACTIVE)
  (set-face-attribute 'vertical-border nil
                      :foreground INACTIVE)


  (set-face-attribute 'show-paren-match nil
                      :background ACCENT)
  (set-face-attribute 'highlight nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG)
  (set-face-attribute 'hl-line nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG)
  (set-face-attribute 'error nil
                      :foreground RED)
  (set-face-attribute 'warning nil
                      :foreground ORANGE)
  (set-face-attribute 'tree-sitter-hl-face:label nil
                      :foreground PARAMETER)
  (set-face-attribute 'minibuffer-prompt nil
                      :foreground ACCENT)
  (set-face-attribute 'success nil
                      :foreground GREEN)
  (set-face-attribute 'compilation-error nil
                      :foreground RED)
  (set-face-attribute 'compilation-warning nil
                      :foreground ORANGE)
  (set-face-attribute 'compilation-info nil
                      :foreground BLUE)
  (set-face-attribute 'compilation-mode-line-fail nil
                      :foreground RED)
  (set-face-attribute 'compilation-mode-line-exit nil
                      :foreground GREEN)
  (set-face-attribute 'compilation-mode-line-run nil
                      :foreground ORANGE)

  (set-face-attribute 'tty-menu-disabled-face nil
                      :foreground INACTIVE
                      :background BACKGROUND_2)
  (set-face-attribute 'tty-menu-selected-face nil
                      :foreground HIGHLIGHT_FG
                      :background HIGHLIGHT_BG)
  (set-face-attribute 'tty-menu-enabled-face nil
                      :foreground FOREGROUND_2
                      :background BACKGROUND_2)
  (set-face-attribute 'treemacs-window-background-face nil
                      :background BACKGROUND_2)
  (set-face-attribute 'treemacs-hl-line-face nil
                      :background HIGHLIGHT_BG
                      :foreground HIGHLIGHT_FG)
#+end_src
* Eglot
Eglot is a minimalistic LSP client. It integrates very well with
emacs, using its built-in tools as much as possible.
#+begin_src emacs-lisp
  (require 'eglot)
  (setq eglot-autoshutdown t)
  (setq eglot-sync-connect 0)
  (define-key eglot-mode-map (kbd "C-c r") 'eglot-rename)
  (global-set-key (kbd "C-c d") 'xref-find-definitions)
  (global-set-key (kbd "C-c h") 'eldoc)
  (global-set-key (kbd "C-c b") 'xref-go-back)
  (global-set-key (kbd "C-c R") 'xref-find-references)
  (add-hook 'prog-mode-hook 'eglot-ensure)
#+end_src
* Org Mode
** General Settings
#+begin_src emacs-lisp
  (require 'org-tempo)
  (setq org-startup-indented t)
  (setq org-pretty-entities t)
  (setq org-hide-emphasis-markers t)
  (setq org-startup-with-inline-images t)
  (setq org-preview-latex-default-process 'dvisvgm)
  (setq org-preview-latex-image-directory "~/.cache/ltximg")
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.4))
  (setq org-startup-with-latex-preview t)
#+end_src
* Doc View Mode
** General Settings
#+begin_src emacs-lisp
  (add-hook 'doc-view-mode-hook (lambda () (display-line-numbers-mode -1)))
  (add-hook 'doc-view-mode-hook (lambda () (pixel-scroll-precision-mode -1)))
  (setq doc-view-scale-internally t)
  (setq doc-view-continuous t)
#+end_src
