.config/emacs/colorscheme.el

(set-face-attribute 'tree-sitter-hl-face:escape nil
                    :inherit 'font-lock-string
                    :foreground KEYWORD)

(set-face-attribute 'font-lock-doc-face nil
                    :inherit 'font-lock-comment-face)
(set-face-attribute 'link nil
                    :foreground CYAN
                    :underline t)
(set-face-attribute 'link-visited nil
                    :foreground MAGENTA
                    :underline t)

(set-face-attribute 'font-lock-negation-char-face nil
                    :inherit 'font-lock-operator-face)
(set-face-attribute 'font-lock-preprocessor-face nil
                    :foreground ORANGE)

(set-face-attribute 'line-number nil
                    :foreground COMMENT)
(set-face-attribute 'line-number-current-line nil
                    :foreground FOREGROUND_1)

(set-face-attribute 'tree-sitter-hl-face:constant nil
                    :inherit 'font-lock-constant-face)



(set-face-attribute 'warning nil
                    :foreground ORANGE)
(set-face-attribute 'font-lock-warning-face nil
                    :inherit 'warning)


(set-face-attribute 'tree-sitter-hl-face:variable.parameter nil
                    :foreground PARAMETER)
(set-face-attribute 'region nil
                    :foreground HIGHLIGHT_FG
                    :background HIGHLIGHT_BG
                    :weight 'bold)
(set-face-attribute 'mode-line-highlight nil
                    :foreground HIGHLIGHT_FG
                    :background HIGHLIGHT_BG)

(set-face-attribute 'window-divider nil
                    :foreground INACTIVE)
(set-face-attribute 'vertical-border nil
                    :foreground INACTIVE)


(set-face-attribute 'show-paren-match nil
                    :background ACCENT)
(set-face-attribute 'highlight nil
                    :foreground HIGHLIGHT_FG
                    :background HIGHLIGHT_BG)
(set-face-attribute 'hl-line nil
                    :foreground HIGHLIGHT_FG
                    :background HIGHLIGHT_BG)
(set-face-attribute 'error nil
                    :foreground RED)
(set-face-attribute 'warning nil
                    :foreground ORANGE)
(set-face-attribute 'tree-sitter-hl-face:label nil
                    :foreground PARAMETER)
(set-face-attribute 'minibuffer-prompt nil
                    :foreground ACCENT)
(set-face-attribute 'success nil
                    :foreground GREEN)
(set-face-attribute 'compilation-error nil
                    :foreground RED)
(set-face-attribute 'compilation-warning nil
                    :foreground ORANGE)
(set-face-attribute 'compilation-info nil
                    :foreground BLUE)
(set-face-attribute 'compilation-mode-line-fail nil
                    :foreground RED)
(set-face-attribute 'compilation-mode-line-exit nil
                    :foreground GREEN)
(set-face-attribute 'compilation-mode-line-run nil
                    :foreground ORANGE)

(set-face-attribute 'tty-menu-disabled-face nil
                    :foreground INACTIVE
                    :background BACKGROUND_2)
(set-face-attribute 'tty-menu-selected-face nil
                    :foreground HIGHLIGHT_FG
                    :background HIGHLIGHT_BG)
(set-face-attribute 'tty-menu-enabled-face nil
                    :foreground FOREGROUND_2
                    :background BACKGROUND_2)
(setq treemacs-window-background-color `(,BACKGROUND_2 . ,HIGHLIGHT_BG))
